app/controllers/cats_controller.rb

    def index
        @cats = Cat.all
---
SELECT  "cats".* FROM "cats" WHERE (200) LIMIT $1  [["LIMIT", 1]]

    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "this is a cat"], ["updated_at", "2019-02-26 21:51:29.964351"], ["id", 3]]